x, y = 5, 3
print('---1.1. Начальное----------------')
print(f'x = {x}, id(x) = {id(x)}')
x = x + y
print('---1.1. x = x + y----------------')
print(f'x = {x}, id(x) = {id(x)}')

x, y = 6, 3
print('---1.2. Начальное----------------')
print(f'x = {x}, id(x) = {id(x)}')
x += y
print('---1.2. x += y----------------')
print(f'x = {x}, id(x) = {id(x)}')
print('Вывод: ID меняется в обоих случаях')
print('')
print('')

x, y = [1, 2], [3, 4]
print('---2.1. Начальное----------------')
print(f'x = {x}, id(x) = {id(x)}')
x = x + y
print('---2.1. x = x + y----------------')
print(f'x = {x}, id(x) = {id(x)}')

x, y = [5, 6], [3, 4]
print('---2.2 Начальное----------------')
print(f'x = {x}, id(x) = {id(x)}')
x += y
print('---2.2. x += y----------------')
print(f'x = {x}, id(x) = {id(x)}')
print('Вывод: ID меняется только в случае 2.1, потому что список - изменяемый тип')